/* Location and Loading */
"Locating..." = "Locating...";
"Location Failed" = "Location Failed";
"Location permission required" = "Location permission required";
"Current Location" = "Current Location";

/* Weather Data */
"Unable to fetch weather data" = "Unable to fetch weather data";
"Forecast data is not available yet" = "Forecast data is not available yet";
"We don't have data for past weather." = "We don't have data for past weather.";

/* Weather Conditions */
"Clear" = "Clear";
"Mostly Clear" = "Mostly Clear";
"Partly Cloudy" = "Partly Cloudy";
"Mostly Cloudy" = "Mostly Cloudy";
"Cloudy" = "Cloudy";
"Foggy" = "Foggy";
"Drizzle" = "Drizzle";
"Rain" = "Rain";
"Heavy Rain" = "Heavy Rain";
"Snow" = "Snow";
"Sleet" = "Sleet";
"Thunderstorms" = "Thunderstorms";
"Blizzard" = "Blizzard";
"Blowing Snow" = "Blowing Snow";
"Freezing Drizzle" = "Freezing Drizzle";
"Freezing Rain" = "Freezing Rain";
"Frigid" = "Frigid";
"Hail" = "Hail";
"Hot" = "Hot";
"Hurricane" = "Hurricane";
"Isolated Thunderstorms" = "Isolated Thunderstorms";
"Scattered Thunderstorms" = "Scattered Thunderstorms";
"Strong Storms" = "Strong Storms";
"Tropical Storm" = "Tropical Storm";
"Windy" = "Windy";
"Wintry Mix" = "Wintry Mix";
"Unknown Weather" = "Unknown Weather";

/* UI Actions */
"Refresh" = "Refresh";

/* Menu Items */
"About MenuCal" = "About MenuCal";
"Quit MenuCal" = "Quit MenuCal";
"OK" = "OK";

/* About Dialog */
"MenuCal is a simple calendar and weather app for your menu bar.\n\nVersion 1.0\n\nWeather data provided by Apple Weather" = "MenuCal is a simple calendar and weather app for your menu bar.\n\nVersion 1.0\n\nWeather data provided by Apple Weather";

/* Location Permission */
"This app uses location services to provide weather information for your current location." = "This app uses location services to provide weather information for your current location."; 